modules/blog/controllers/DefaultController.php

SELECT * FROM `posts`
SELECT COUNT(*) FROM `posts`
SELECT * FROM `posts` LIMIT 9
---
    public function actionIndex()
    {
        $AllPosts = Posts::find();

        if($AllPosts) {

            $pages = new Pagination([ 'totalCount' => $AllPosts->count(), 'pageSize' => 9 ]);
            $posts = $AllPosts->offset($pages->offset)
                ->limit($pages->limit)
                ->all();

INSERT INTO `posts` (`title`, `text`, `text_preview`, `img`) VALUES ('Варкрафт', '<p>Мирный Азерот на грани войны: цивилизации угрожает раса свирепых воинов-орков, покидающих умирающий Дренор, чтобы с оружием в руках обрести новый дом.Темный портал соединил два мира, в результате чего одну армию ждет уничтожение, а вторую &ndash; вымирание.Два великих героя сражаются по разные стороны конфликта, и когда они сойдутся на поле брани, от результата этой схватки будет зависеть слишком многое...Перед вами официальная новеллизация самого ожидаемого блокбастера 2016 года от Legendary Pictures и Universal Pictures, основанного на глобальном феномене компании Blizzard Entertainment, имя которому &ndash; ВАРКРАФТ. Читай книгу &ndash; смотри фильм!</p>\r\n', 'https://play.google.com/store/books/details/%D0%9A%D1%80%D0%B8%D1%81%D1%82%D0%B8_%D0%93%D0%BE%D0%BB%D0%B4%D0%B5%D0%BD_%D0%92%D0%B0%D1%80%D0%BA%D1%80%D0%B0%D1%84%D1%82?id=QRA_DAAAQBAJ', '/static/images/img59468aa4d.jpeg')
---
    public function actionCreate()
    {
        $model = new Posts();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

UPDATE `posts` SET `text`='<p>The Black &mdash; четвёртый студийный альбом британской пост-хардкор группы Asking Alexandria, который вышел 25 марта 2016 года. Это единственный альбом с вокалистом Денисом Шафоростовым, заменившим оригинального вокалиста группы Дэнни Уорснопа.</p>\r\n\r\n<p>Источник описания: <a href=\"https://www.google.com/url?q=https://ru.wikipedia.org/wiki/The_Black&amp;sa=D&amp;usg=AFQjCNFm0fvZChXogpfL4n8k5wj2lDFPZw\" target=\"_blank\">Wikipedia</a> (<a href=\"https://www.google.com/url?q=http://creativecommons.org/licenses/by-sa/4.0/legalcode&amp;sa=D&amp;usg=AFQjCNEJkIPnS8VUROby7SaxyhvLXiRGdA\" target=\"_blank\">Creative Commons Attribution CC-BY-SA 4.0</a>)</p>\r\n\r\n<p>&nbsp;</p>\r\n' WHERE `id`=10
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `posts` WHERE `id`='10'
---
    protected function findModel($id)
    {
        if (($model = Posts::findOne($id)) !== null) {